Tekla.Structures.Filtering.Expression
The Expression class represents an expression. This is a base class for other expressions and cannot be used directly.

Tekla.Structures.Filtering.Expression._ExpressionId
Internal Expression Identifier.

Tekla.Structures.Filtering.Expression.Properties
Gets or sets the dictionary of custom properties.

Tekla.Structures.Filtering.Expression.Clone``1(``0)
Clones an object.
The object type.
Source: The object to be used.
Returns: The cloned object.
Throws System.ArgumentException: Thrown when a non-serializable object is specified.

Tekla.Structures.Filtering.Expression.ToString
Creates a string representation of the current object.
Returns: A new string representing the current object.